xml/verifyCustomerExists.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope" xmlns:e="http://www.technisys.net/cmm/services/errors/v1.0" xmlns:md="http://www.technisys.net/cmm/services/metadata/v2.0" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
  <SOAP-ENV:Header>
    <md:metadata>
      <serviceId>verifyCustomerExists</serviceId>
      <serviceVersion>0.0</serviceVersion>
      <sessionId>${sessionId}</sessionId>
      <targetChannel>
        <mnemonic>${channel}</mnemonic>
      </targetChannel>
      <executingChannel>
        <mnemonic>${channel}</mnemonic>
      </executingChannel>
      <address>ip=${ip};</address>
      <locale>en_PA</locale>
      <cmmDispatchDate>${cmmDispatchDate}</cmmDispatchDate>
      <customProperties/>
    </md:metadata>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body>
    <srv:verifyCustomerExistsRequest xmlns:srv="http://www.technisys.net/cmm/services/verifyCustomerExists/rq/v0.0">
      <customer name="customer">
        <customerId>uriSFB=ECU#${tipoIdentificacion}#${identificacion}</customerId>
      </customer>
    </srv:verifyCustomerExistsRequest>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>